import numpy as np

def concatenate():
    """
    数组的拼接，合并
    np.append 虽然可读性好，灵活，但是内存占用大
    np.concatenate则不会占内存大
    Returns:

    """
    """
        >>> a
    array(［0, 1, 2],
           [3, 4, 5],
           [6, 7, 8］)
    >>> b = a*2
    >>> b
    array(［ 0, 2, 4],
           [ 6, 8, 10],
           [12, 14, 16］)
    
    水平组合，axis是1 ，需注意
    >>> np.concatenate((a,b),axis=1)
    array(［ 0, 1, 2, 0, 2, 4],
           [ 3, 4, 5, 6, 8, 10],
           [ 6, 7, 8, 12, 14, 16］)
     
    垂直组合，axis是0      
    >>> np.concatenate((a,b),axis=0)
    array(［ 0, 1, 2],
           [ 3, 4, 5],
           [ 6, 7, 8],
           [ 0, 2, 4],
           [ 6, 8, 10],
           [12, 14, 16］)
           
    深度组合：沿着纵轴方向组合 
    >>> np.dstack((a,b))
    array(［[ 0, 0],
            [ 1, 2],
            [ 2, 4］,
    
           ［ 3, 6],
            [ 4, 8],
            [ 5, 10］,
    
           ［ 6, 12],
            [ 7, 14],
            [ 8, 16］])
            

    """